// utils/weatherDictionaries.js
export const weatherCodes = {
  0: "Ясно",
  1: "Преимущественно ясно",
  2: "Переменная облачность",
  3: "Пасмурно",
  45: "Туман",
  48: "Изморозь",
  51: "Лёгкая морось",
  53: "Морось",
  55: "Сильная морось",
  61: "Слабый дождь",
  63: "Дождь",
  65: "Сильный дождь",
  71: "Слабый снег",
  73: "Снег",
  75: "Сильный снег",
  80: "Ливень",
  95: "Гроза",
};

export const yandexConditions = {
  clear: "Ясно",
  partly_cloudy: "Малооблачно",
  cloudy: "Облачно с прояснениями",
  overcast: "Пасмурно",
  drizzle: "Морось",
  light_rain: "Небольшой дождь",
  rain: "Дождь",
  heavy_rain: "Сильный дождь",
  thunderstorm: "Гроза",
  snow: "Снег",
};