// utils/weatherDictionaries.js
export const weatherCodes = {
  0: "☀️ Ясно",
  1: "🌤️ Малооблачно",
  2: "⛅ Переменная облачность",
  3: "☁️ Пасмурно",
  45: "🌫️ Туман",
  48: "🌫️ Оседающий туман",
  51: "🌦️ Лёгкая морось",
  53: "🌧️ Морось",
  55: "🌧️ Сильная морось",
  61: "🌦️ Лёгкий дождь",
  63: "🌧️ Дождь",
  65: "🌧️ Ливень",
  71: "🌨️ Лёгкий снег",
  73: "🌨️ Снег",
  75: "❄️ Сильный снег",
  80: "🌦️ Кратковременные дожди",
  81: "🌧️ Дождливая погода",
  82: "🌧️ Сильный ливень",
  95: "⛈️ Гроза",
  99: "⛈️ Гроза с градом"
};

export const yandexConditions = {
  clear: "☀️ Ясно",
  partly_cloudy: "🌤️ Малооблачно",
  cloudy: "☁️ Облачно с прояснениями",
  overcast: "☁️ Пасмурно",
  drizzle: "🌦️ Морось",
  light_rain: "🌦️ Лёгкий дождь",
  rain: "🌧️ Дождь",
  moderate_rain: "🌧️ Сильный дождь",
  heavy_rain: "🌧️ Ливень",
  showers: "🌧️ Ливни",
  wet_snow: "🌨️ Дождь со снегом",
  light_snow: "🌨️ Лёгкий снег",
  snow: "❄️ Снег",
  snow_showers: "❄️ Снегопад",
  hail: "🌨️ Град",
  thunderstorm: "⛈️ Гроза"
};